//=================================================================================================================
//
// 背景の処理　〔bg.cpp〕
// Anthor:Nanaka maeno
//
//=================================================================================================================
#ifndef _BACK_H_
#define _BACK_H_

#include "scene2D.h"


//*******************************************************************************************************
// 前方宣言
//*******************************************************************************************************
class CBg;


//*******************************************************************************************************
// マクロ定義
//*******************************************************************************************************
#define MAX_BG (3)			// 背景の最大寿命
#define SPEED_1 (0.0008f)	// 手前の背景のスピード
#define SPEED_2 (0.0009f)	// 真ん中の背景のスピード
#define SPEED_3 (0.0001f)	// 奥の背景のスピード

//*******************************************************************************************************
// クラス定義
//*******************************************************************************************************
class CBg :public CScene
{
public:
	 CBg();
	~ CBg();
	static CBg *Create(D3DXVECTOR3 pos, D3DXVECTOR3 scale);
	HRESULT  Init(D3DXVECTOR3 pos,D3DXVECTOR3 scale);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	static HRESULT Load(void);
	static void Unload(void);

private:
	static LPDIRECT3DTEXTURE9 m_pTexture[MAX_BG];	// 背景のテクスチャーポインタ
	CScene2D *m_apScene2D[MAX_BG];					// ポリゴンのポインタ
	float m_fSpeed[MAX_BG];							// 背景のスピード
	float m_fPosTexU[MAX_BG];						// テクスチャU座標
	float m_fPosTexV[MAX_BG];						// テクスチャV座標

};



//=================================================================================================================
// プロトタイプ宣言
//=================================================================================================================

#endif // !_BACK_H_

