//=================================================================================================================
//
// フェードの処理　〔fade.cpp〕
// Anthor:Nanaka maeno
//
//=================================================================================================================
#ifndef _FADE_H_
#define	_FADE_H_

//*******************************************************************************************************
// ヘッダファイルのインクルード
//*******************************************************************************************************
#include "scene2D.h"
#include "manager.h"

//*******************************************************************************************************
// 前方宣言
//*******************************************************************************************************

//*******************************************************************************************************
// クラス定義
//*******************************************************************************************************
class CFade
{
public:
	// フェードの列挙型
	typedef enum
	{
		FADE_NONE = 0,
		FADE_IN,
		FADE_OUT,
		FADE_MAX
	}FADE;

	CFade();
	~CFade();
	static CFade *Create(CManager::MODE modeNext);

	HRESULT Init(CManager::MODE modeNext);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	void SetFade(FADE fade,CManager::MODE modeNext);
	static FADE GetFade(void);

private:
	LPDIRECT3DVERTEXBUFFER9	m_pVtxBuffFade = NULL;	// 頂点バッファへのポインタ
	static FADE m_fade;								// フェードの状態
	static CManager::MODE m_modeNext;				// 次のモード(画面)
	D3DXCOLOR m_colorFade;							// フェード色
};
#endif