//======================================================================================================
//
// レンダリング処理 [renderer.cpp]
// Author : nanaka maeno
//
//======================================================================================================
#ifndef _RENDERER_H_
#define _RENDERER_H_


//*******************************************************************************************************
// ヘッダファイルのインクルード
//*******************************************************************************************************
#include "main.h"


//*******************************************************************************************************
// 前方宣言
//*******************************************************************************************************
class CFade;

//*******************************************************************************************************
// クラス定義
//*******************************************************************************************************
class CRenderer
{
public:
	CRenderer();
	~CRenderer();
	HRESULT Init(HWND hWnd, bool bWindow);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	LPDIRECT3DDEVICE9 GetDevice(void) { return m_pD3DDevice; }

private:

#ifdef _DEBUG
	void DrawFPS(void);
#endif

	LPDIRECT3D9				m_pD3D = NULL;			// Direct3Dオブジェクト
	LPDIRECT3DDEVICE9		m_pD3DDevice = NULL;	// Deviceオブジェクト(描画に必要)
	LPDIRECT3DVERTEXBUFFER9	m_pVtxBuff = NULL;		// 頂点バッファへのポインタ
	LPDIRECT3DTEXTURE9      m_pTexture = NULL;		// テクスチャのポインタ
	D3DXVECTOR3             m_posPolygon;			// ポリゴンの位置
	LPD3DXFONT				m_pFont = NULL;			// フォントへのポインタ


};
#endif

