//=================================================================================================================
//
// タイトルの処理　〔title.cpp〕
// Anthor:Nanaka maeno
//
//=================================================================================================================
#ifndef _TITLE_H_
#define _TITLE_H_


//*******************************************************************************************************
// 前方宣言
//*******************************************************************************************************


//*******************************************************************************************************
// マクロ定義
//*******************************************************************************************************
#define MAX_TITLE_BG (4)		// 背景の最大数
#define TITLE_SPEED_1 (0.001f)	// 手前の背景のスピード
#define TITLE_SPEED_2 (0.004f)	// 真ん中の背景のスピード
#define TITLE_SPEED_3 (0.0001f)	// 奥の背景のスピード

//*******************************************************************************************************
// クラス定義
//*******************************************************************************************************
class CTitle : public CScene
{
public:
	typedef enum
	{
		TITLE_BG = 0,
		TITLE_DOT1,
		TITLE_DOT2,
		TITLE_ENTER,
		TITLE_MAX
	}TITLE;

	CTitle();
	~CTitle();
	static CTitle *Create(D3DXVECTOR3 pos, D3DXVECTOR3 scale);
	HRESULT Init(D3DXVECTOR3 pos, D3DXVECTOR3 scale);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	void EnterUI(void);
	static HRESULT Load(void);
	static void Unload(void);

private:
	static LPDIRECT3DTEXTURE9 m_pTexture[MAX_TITLE_BG];	// 背景のテクスチャーポインタ
	CScene2D *m_apScene2D[MAX_TITLE_BG];				// ポリゴンのポインタ
	D3DXCOLOR m_ButtonCol;								// ボタンの変数
	float AddCol = 0.0f;								// 加算の変数
	int m_nCntPush;										// カウンター
	bool m_bPush;										// 押したかどうか
	float m_fSpeed[MAX_TITLE_BG];						// 背景のスピード
	float m_fPosTexU[MAX_TITLE_BG];						// テクスチャU座標
	float m_fPosTexV[MAX_TITLE_BG];						// テクスチャV座標

};



//=================================================================================================================
// プロトタイプ宣言
//=================================================================================================================

#endif // !_TITLE_H_


