//=================================================================================================================
//
// 弾の処理　〔bullet.cpp〕
// Anthor:Nanaka maeno
//
//=================================================================================================================
#ifndef BULLET_H_
#define BULLET_H_

#include "main.h"
//=================================================================================================================
// 列挙型
//=================================================================================================================
typedef enum
{
	BULLETTYRE_PLAYER = 0,	// プレイヤーの弾
	BULLETTYRE_ENEMY,		// 敵の弾
	BULLETTYRE_MAX
}BULLETTYRE;

//=================================================================================================================
// マクロ定義
//=================================================================================================================
#define BULLET_PLAYER_LIFE (30)								// プレイヤーの弾の寿命
#define BULLET_PLAYER_SIZE (D3DXVECTOR3(15.0f,15.0f,0.0f))	// プレイヤーの弾の大きさ
#define BULLET_ENEMY_SIZE (D3DXVECTOR3(15.0f,15.0f,0.0f))	// 敵の弾の大きさ

//=================================================================================================================
// プロトタイプ宣言
//=================================================================================================================
HRESULT InitBullet(void);
void UninitBullet(void);
void UpdateBullet(void);
void DrawBullet(void);
void SetBullet(D3DXVECTOR3 pos, D3DXVECTOR3 size, D3DXVECTOR3 move, int nLife, BULLETTYRE type);
void SetVertexBullet(int nCntBullet);

#endif